tutorials/pimpleFoam/crossFlowTurbineAL/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


turbine0
{
    type            crossFlowTurbineALSource;
    active          on;         // on/off switch
    selectionMode   cellSet;    // cellSet // points //cellZone
    cellSet         turbine0;   // probably won't use this, but we'll see

    crossFlowTurbineALSourceCoeffs
    {
        fieldNames      (U);
        nBlades	        3;
        tipEffect       0.95; 

        freeStreamVelocity (1 0 0);
        upstreamPoint   (-1.0, 0, 0); // probably don't need this
        tipSpeedRatio   1.9;

        origin          (0 0 0);
        axis            (0 0 1); // negative for opposite rotation
        rotorRadius     0.5; // for tip speed ratio calculation

        blades
        {
            blade0
            {
                nElements   20;
                elementData
                ( // axialDistance, radius, azimuth, profile, chord, chordMount, pitch
                    (-0.5 0.5 0.0 NACA0020 0.14 0.5 0.0)
                    ( 0.5 0.5 0.0 NACA0020 0.14 0.5 0.0)
                );
            }
            blade1
            {
                nElements   20;
                elementData
                ( // axialDistance, radius, azimuth, profile, chord, chordMount, pitch
                    (-0.5 0.5 120.0 NACA0020 0.14 0.5 0.0)
                    ( 0.5 0.5 120.0 NACA0020 0.14 0.5 0.0)
                );
            }
            blade2
            {
                nElements   20;
                elementData
                ( // axialDistance, radius, azimuth, profile, chord, chordMount, pitch
                    (-0.5 0.5 240.0 NACA0020 0.14 0.5 0.0)
                    ( 0.5 0.5 240.0 NACA0020 0.14 0.5 0.0)
                );
            };
        };
        
        profiles
        {
            NACA0020
            {
            type 	lookup;
            data 	(
                (-90 0.21 1.45) // alpha C_d C_l
                (-18 0.21 1.45)
                (-16 0.165 1.3)
                (-14 0.125 1.1)
                (-12 0.092 0.95)
                (-10 0.07 0.8)
                (-8 0.05 0.64)
                (-6 0.04 0.5)
                (-4 0.028 0.32)
                (-2 0.022 0.18)
                (0 0.02 0)
                (2 0.022 0.18)
                (4 0.028 0.32)
                (6 0.04 0.5)
                (8 0.05 0.64)
                (10 0.07 0.8)
                (12 0.092 0.95)
                (14 0.125 1.1)
                (16 0.165 1.3)
                (18 0.21 1.45)
                (90 0.21 1.45)
                );
            };
        };
    }
}

// ************************************************************************* //
